In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [3]:
premise_file = "../Resources/LicensePremise.csv"
premise_data_df = pd.read_csv(premise_file, index_col=)
premise_data_df.head()

,License Serial Number,Premises Name,License Certificate Number,License Received Date,County ID Code
0,1311660,CANA ARRIBA GROCERY NO 2 INC,NaN,2018-06-29T00:00:00,0
1,1310023,JOHANA GROCERY & DELI CORP,NaN,2018-04-27T00:00:00,0
2,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
3,1310024,TKO BEVERAGES LLC,NaN,2018-04-27T00:00:00,1
4,1311663,181 LEXINGTON AVENUE BBQ LLC,NaN,2018-06-29T00:00:00,2

In [4]:
county_file = "../Resources/CountyLicenseCount.csv"
county_data_df = pd.read_csv(county_file)
county_data_df.head()

   ID County Name (Licensee)  County ID Code  License Count
0   0                 ALBANY               5             77
1   1               ALLEGANY              59              4
2   2                  BRONX               0            104
3   3                 BROOME              35             14
4   4            CATTARAUGUS              41              9

### Transform premise DataFrame

In [18]:
premise_sql_temp_df = premise_data_df[["License Serial Number",'Premises Name','County ID Code']]
rename_columns = {"License Serial Number":"id",
                "Premises Name":"premise_name",
                "County ID Code":"country_id"}
premise_sql_df = premise_sql_temp_df.rename(columns=rename_columns)
premise_sql_df.drop_duplicates("id",inplace=True)
premise_sql_df.set_index("id",inplace=True)
premise_sql_df.head()

                         premise_name  country_id
id
1311660  CANA ARRIBA GROCERY NO 2 INC           0
1310023    JOHANA GROCERY & DELI CORP           0
1310024             TKO BEVERAGES LLC           1
1311663  181 LEXINGTON AVENUE BBQ LLC           2
1310029        AZIZ DELI & GRILL CORP           1

### Transform county DataFrame

In [ ]:
county_sql_temp_df = county_data_df[["License Serial Number",'Premises Name','County ID Code']]
rename_columns = {"License Serial Number":"id",
                "Premises Name":"premise_name",
                "County ID Code":"country_id"}
county_sql_df = county_sql_temp_df.rename(columns=rename_columns)
county_sql_df.drop_duplicates("id",inplace=True)
county_sql_df.set_index("id",inplace=True)
county_sql_df.head()

### Create database connection

In [ ]:
# Confirm tables

### Load DataFrames into database